app/src/test/resources/xml/example-hrmanager.xml

<SOAP-ENV:Envelope xmlns:m="http://www.nav.no/nav_stilling_reg.wsdl" xmlns:m0="http://www.nav.no/nav_stilling_typer.xsd" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:m2="http://ns.hr-xml.org/2007-04-15" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <m:LeggInnStillinger>
      <StillingListe>
        <m0:PositionOpening>
          <PositionPostings>
            <PositionPosting>
              <Id>
                <IdValue>99938</IdValue>
              </Id>
            </PositionPosting>
          </PositionPostings>
          <PositionSupplier>
            <SupplierId>
              <IdValue>HR Manager</IdValue>
            </SupplierId>
            <EntityName>Kopervik videregående skole</EntityName>
            <ContactMethod>
              <Telephone>
                <FormattedNumber></FormattedNumber>
              </Telephone>
              <Fax>
                <FormattedNumber></FormattedNumber>
              </Fax>
            </ContactMethod>
            <Role />
          </PositionSupplier>
          <PositionProfile>
            <ProfileName>Undervisningsstilling - vikariat innen tysk, naturfag og geografi</ProfileName>
            <PositionDateInfo>
              <StartDate />
              <ExpectedEndDate />
              <MaximumStartDate>2018-12-09</MaximumStartDate>
              <StartAsSoonAsPossible>false</StartAsSoonAsPossible>
            </PositionDateInfo>
            <Organization>Rogaland fylkeskommune er en av fylkets største arbeidsgivere med rundt 3500 ansatte. Vil du være med å utvikle Rogaland sammen med flinke og engasjerte kollegaer?&lt;br /&gt;&lt;br /&gt;Sammen utvikler vi ett godt Rogaland!</Organization>
            <PositionDetail>
              <Company />
              <PhysicalLocation>
                <Name></Name>
                <PostalAddress>
                  <PostalCode>4250</PostalCode>
                  <Recipient>
                    <PersonName>
                      <FormattedName></FormattedName>
                    </PersonName>
                  </Recipient>
                  <DeliveryAddress>
                    <AddressLine />
                  </DeliveryAddress>
                </PostalAddress>
              </PhysicalLocation>
              <JobCategory>
                <CategoryDescription />
              </JobCategory>
              <PositionTitle />
              <PositionClassification />
              <PositionSchedule percentage="100" />
              <Competency name="required" />
              <JobLevelInfo>
                <JobPlan />
                <JobGrade />
              </JobLevelInfo>
            </PositionDetail>
            <FormattedPositionDescription>
              <Value><![CDATA[<div><strong>Kopervik videregående skole </strong></div>
<div>Postboks 8, 4291 Kopervik, tlf. 52
81 41 00 </div>
<div>www.kopervik.vgs.no </div>
<div> </div>
<div>Kopervik videregående skole er en
trivelig og levende skole i flotte omgivelser som ligger i Karmøy kommune.
Skolen har studieforberedende utdanningstilbud innen idrettsfag, medier og
kommunikasjon og studiespesialisering. Skolen har ca 500 elever og 60 ansatte. Kopervik
videregående skole er en utfordrende og spennende arbeidsplass som legger stor
vekt på både elevers og ansattes trivsel og utvikling.  </div>
<div> </div>
<div><strong>Undervisningsstilling vikariat innen tysk,
naturfag og geografi </strong></div>
<div> </div>
<div>Fra
15.01.2019 og ut skoleåret har vi ledig et 50-100% vikariat innen fagene tysk,
naturfag og geografi.  </div>
<div> </div>
<div><strong>Det
kreves: </strong></div>
<div>Relevant
undervisningskompetanse i ett eller flere av fagområdene </div>
<div>Praktisk-pedagogisk
utdanning </div>
<div> </div>
<div><strong>Det
er ønskelig med: </strong></div>
<div>Utdanning på
mastergradsnivå eller tilsvarende </div>
<div> </div>
<div>Vi ønsker
en person som har gode samarbeidsevner, kan stå på i et travelt arbeidsmiljø,
liker å være klasseleder og har godt humør.  </div>
<div> </div>
<div>Personlig
egnethet vil bli vektlagt og søkere som dekker flere fagområder kan bli foretrukket. </div>
<div> </div>
<div>Lønns- og
arbeidsvilkår er fastsatt i lov- og avtaleverk. Det kreves godkjent
politiattest for stillinger i videregående skole. </div>
<div> </div>
<div>Nærmere
opplysninger om stillingen fås ved henvendelse til rektor Sveinung Valen tlf.
952 26 268 eller epost: sveinung.valen@skole.rogfk.no. </div>
<div> </div>
<div><strong>Søknadsfrist:
09.12.2018 </strong></div>
<div> </div>
<br>

<div class='NavHrManagerApplicationFormLinkWrapper'><a href='https://candidate.hr-manager.net/ApplicationInit.aspx?cid=1160&ProjectId=144421&DepartmentId=18972&MediaId=4617&SkipAdvertisement=true' target='_blank'>Søk på stillingen</a></div>]]></Value>
            </FormattedPositionDescription>
            <HowToApply>
              <PersonName></PersonName>
              <ApplicationMethod>
                <Telephone>
                  <FormattedNumber></FormattedNumber>
                </Telephone>
                <InternetEmailAddress></InternetEmailAddress>
                <InternetWebAddress></InternetWebAddress>
                <PostalAddress>
                  <PostalCode />
                  <Recipient>
                    <PersonName />
                  </Recipient>
                  <DeliveryAddress>
                    <AddressLine />
                    <StreetName />
                    <PostOfficeBox />
                  </DeliveryAddress>
                </PostalAddress>
              </ApplicationMethod>
            </HowToApply>
          </PositionProfile>
          <NumberToFill>1</NumberToFill>
        </m0:PositionOpening>
      </StillingListe>
    </m:LeggInnStillinger>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
